src/java-test/com/zimbra/common/soap/refNonExistentFileInEntity.xml

<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE foo [
<!ENTITY readNonExist SYSTEM "file:///tmp/not/there/non-existent.xml" >]>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header>
<context xmlns="urn:zimbra">
  <authToken>deleted</authToken>
<nosession></nosession>
</context>
</soap:Header>
<soap:Body>
<GetFolderRequest xmlns="urn:zimbraMail">
    <folder><path>Fun[&readNonExist;]Here</path></folder>
</GetFolderRequest>
</soap:Body>
</soap:Envelope>
